//////////////////////////////////////////////////////////////////////////
/*
队列(queue)容器：
1、不支持迭代器， 即不可以遍历
2、不支持随机存取
3、一端插入，一段删除
4、支持存储基本数据类型、对象指针、对象
*/
//////////////////////////////////////////////////////////////////////////

#include <iostream>
#include <queue>

int main()
{
	//创建队列
	std::queue<int> q;

	//queue 操作
	//1-入队
	for (int i = 0;i < 10; i++)
	{
		q.push(i + 1);
	}

	//2-访问长度
	std::cout << "q-Length: " << q.size() << std::endl;

	//3-访问队头、队尾元素
	std::cout << "队头元素: " << q.front() << std::endl;//访问队头元素
	std::cout << "队尾元素: " << q.back() << std::endl;//访问队尾元素

	//4-出队
	while (!q.empty())
	{
		std::cout << "出队元素: " << q.front() << std::endl;//访问队头元素
		q.pop(); //出队
	}

	return 0;
}